caAERS/software/jbi/caaers2adeers-sync/core-camel-su/src/test/resources/xslt/test2.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <stud:updateStudy xmlns:stud="http://schema.integration.caaers.cabig.nci.nih.gov/study">
            <stud:studies>
                <stud:study>
                    <shortTitle>Phase II Trial of Flavopiridol and Cisplatin in Advanced Epithelial Ovarian and Primary
                        Peritoneal Carcinomas
                    </shortTitle>
                    <phaseCode>Phase II Trial</phaseCode>
                    <verbatimFirst>true</verbatimFirst>
                    <adeersReporting>true</adeersReporting>
                    <studyPurpose>Treatment</studyPurpose>
                    <aeTermUnique>true</aeTermUnique>
                    <stud:aeTerminology>
                        <stud:ctcVersion>
                            <name>4</name>
                        </stud:ctcVersion>
                    </stud:aeTerminology>
                    <stud:diseaseTerminology>
                        <diseaseCodeTerm>CTEP</diseaseCodeTerm>
                    </stud:diseaseTerminology>
                    <fundingSponsor>
                        <organizationAssignedIdentifier>
                            <value>5876</value>
                        </organizationAssignedIdentifier>
                        <stud:studyFundingSponsor>
                            <stud:organization>
                                <name>Cancer Therapy Evaluation Program</name>
                                <nciInstituteCode>CTEP</nciInstituteCode>
                            </stud:organization>
                        </stud:studyFundingSponsor>
                    </fundingSponsor>
                    <coordinatingCenter>
                        <organizationAssignedIdentifier>
                            <value>5876</value>
                        </organizationAssignedIdentifier>
                        <stud:studyCoordinatingCenter>
                            <stud:organization>
                                <name>Mayo Clinic Rochester</name>
                                <nciInstituteCode>MN026</nciInstituteCode>
                                <type>CCR</type>
                            </stud:organization>
                        </stud:studyCoordinatingCenter>
                    </coordinatingCenter>
                    <identifiers>
                        <stud:systemAssignedIdentifier>
                            <type>Other</type>
                            <value>5876</value>
                            <primaryIndicator>false</primaryIndicator>
                            <systemName>CTEP-ESYS</systemName>
                        </stud:systemAssignedIdentifier>
                    </identifiers>
                    <treatmentAssignments>
                        <stud:treatmentAssignment>
                            <ctepDbIdentifier>11451</ctepDbIdentifier>
                            <code>A</code>
                            <description>(Cycle= 3 Weeks):
                                Cisplatin 60 mg/m2 IV on day 1
                                Flavopiridol 100 mg/m2 CIV over 24 hours on day 1
                            </description>
                        </stud:treatmentAssignment>
                    </treatmentAssignments>
                    <studyAgents>
                        <stud:studyAgent>
                            <stud:agent>
                                <nscNumber>649890</nscNumber>
                                <name>Alvocidib (flavopiridol)</name>
                            </stud:agent>
                            <indType>OTHER</indType>
                            <partOfLeadIND>
                                false
                            </partOfLeadIND>
                        </stud:studyAgent>
                        <stud:studyAgent>
                            <stud:agent>
                                <nscNumber>119875</nscNumber>
                                <name>CISplatin</name>
                            </stud:agent>
                            <indType>NA_COMMERCIAL</indType>
                            <partOfLeadIND>
                                false
                            </partOfLeadIND>
                        </stud:studyAgent>
                    </studyAgents>
                    <studyDevices/>
                    <otherInterventions/>
                    <ctepStudyDiseases>
                        <stud:ctepStudyDisease>
                            <stud:diseaseTerm>
                                <term>Ovarian epithelial cancer</term>
                                <meddraCode>10033159</meddraCode>
                            </stud:diseaseTerm>
                            <leadDisease>true</leadDisease>
                        </stud:ctepStudyDisease>
                        <stud:ctepStudyDisease>
                            <stud:diseaseTerm>
                                <term>Primary peritoneal carcinoma</term>
                                <meddraCode>10026669</meddraCode>
                            </stud:diseaseTerm>
                            <leadDisease>false</leadDisease>
                        </stud:ctepStudyDisease>
                    </ctepStudyDiseases>
                </stud:study>
            </stud:studies>
        </stud:updateStudy>
    </soapenv:Body>
</soapenv:Envelope>
